Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_phy_osi.c
/****************************************************************************
 * boards/arm/bk7258/contest_board/chip/bk7258_phy_osi.c
 *
 * OS/SoC abstraction tables for the closed Beken RF PHY archives
 * (libbk_phy.a / libcom_phy.a).
 *
 * Like the bluetooth controller, the PHY archive carries no SoC glue: it
 * reaches everything -- analog register access, power and clock gates,
 * calibration storage, logging, allocation -- through two function-pointer
 * tables handed to phy_adapter_init(), plus a third pair handed to
 * rf_adapter_init() that the RF arbiter (rf_module_vote_ctrl) uses.  Until
 * those tables are installed every pointer in them is NULL, which is the
 * bus fault at rwip_init -> xvr_init -> bt_osi_ble_vote_rf_ctrl ->
 * rf_module_vote_ctrl.
 *
 * The four structs below are byte-for-byte replicas of bk_idk
 * components/bk_phy/include/bk_phy_adapter.h and bk_rf_adapter.h with the
 * BK7258 configuration resolved (CONFIG_SOC_BK7236XX=y, CONFIG_SOC_BK7258=y,
 * so neither the BK7256XX nor the BK7239XX/BK7286XX variant of the
 * conditional blocks applies).  The SDK headers are deliberately not
 * included, because this port does not carry the Beken header tree, and the
 * library reads the tables purely by memory layout -- field order and types
 * must not be touched.  The replica was checked against the shipped code
 * rather than against the header alone: rf_module_vote_ctrl's error path
 * loads g_phy_funcs_t offset 0x104 to call the logger, and offset 0x104 is
 * exactly where _log lands in the struct below.
 *
 * Where the vendor calls into an SDK subsystem this port does not have, the
 * entry is a documented stub rather than a guess.  Three port-wide
 * decisions drive most of them, and each affected entry says so again at
 * the point of use:
 *
 *   1. Factory calibration data is unreachable.  The NuttX image is flashed
 *      at 0x11000 while the RF calibration partition sits at 0x7fe000, and
 *      this port has no flash read driver -- the XIP window is CRC-encoded
 *      and cannot be read as a plain data region.  So every "load
 *      calibration from flash/OTP" callback reports "no data", and the
 *      library falls back to the default power tables in bk7258_vnd_cal.c.
 *      Transmit power is therefore nominal rather than per-unit trimmed:
 *      wrong absolute level, correct enough to emit packets, which is the
 *      right trade for a first bring-up.
 *
 *   2. The SARADC is real, driven by bk7258_saradc.c: the transmit-power
 *      detector, the on-die temperature sensor and the supply are all
 *      measured rather than assumed, because the calibration arithmetic
 *      is built on them.  What is still off is the *periodic* re-trim --
 *      _bk_feature_temp_detect_enable reports the feature disabled, since
 *      this port runs no temperature daemon.  Calibration's own one-shot
 *      temperature read does not go through that flag and does happen.
 *
 *   3. Sleep is never entered on this port, so the low-power vote entries
 *      are no-ops.  Note that RF power arbitration is *not* in that
 *      category -- rf_module_vote_ctrl genuinely powers the PHY domain up
 *      and down around radio use, and those entries do real register work.
 *
 * Wi-Fi is not in this image; the Wi-Fi entries are NULL or report "not
 * present" so the library never believes the radio is busy with Wi-Fi.
 *
 * Nothing here runs unless bk7258_phy_adapter_init() and then
 * bk7258_rf_adapter_init() are called, in that order -- the RF arbiter
 * reaches for the PHY table's logger on its error path.  Neither is wired
 * into board bring-up.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stdarg.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h>
#include <syslog.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/kmalloc.h>
#include <nuttx/wqueue.h>

#include "arm_internal.h"
#include "bk7258_memorymap.h"
#include "bk7258_wdt.h"

/****************************************************************************
 * External Function Prototypes
 ****************************************************************************/

/* The polled SARADC driver in bk7258_saradc.c.  Declared here rather than
 * in a header because that is how this board reaches its other chip-layer
 * entry points (see apps/face/face_main.c), and because the converter has
 * exactly one consumer: the acquisition entries further down.
 */

uint32_t bk7258_saradc_div(uint32_t adc_clk);
int bk7258_saradc_pwrup(void);
int bk7258_saradc_start(uint8_t channel, uint8_t mode, uint32_t div,
                        uint8_t saturate, uint8_t steady, uint8_t rate,
                        uint8_t filter);
int bk7258_saradc_stop(void);
int bk7258_saradc_read(uint16_t *buf, uint32_t size, uint32_t timeout_ms);
void bk7258_saradc_tempsensor(bool enable);
void bk7258_saradc_set_flag(uint8_t flag);

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Handshake the library validates before it uses the PHY table at all
 * (bk_idk components/bk_phy/src/bk_phy_adapter.c PHY_OSI_VERSION).
 */

#define PHY_OSI_VERSION             0x00060006

/* System block registers.  Word indices are the SDK's, kept visible so the
 * addresses can be checked against sys_ll.h: analog shadow registers start
 * at word 0x40 and their busy flags live in word 0x3a, one bit per shadow.
 */

#define PHY_SYS_POWER               (BK7258_SYS_BASE + (0x10 << 2))
#define PHY_SYS_CLK_EN              (BK7258_SYS_BASE + (0x0c << 2))
#define PHY_SYS_ANA_BUSY            (BK7258_SYS_BASE + (0x3a << 2))
#define PHY_SYS_ANA_REG(n)          (BK7258_SYS_BASE + ((0x40 + (n)) << 2))

#define PHY_CKEN_PHY                (1u << 27)

/* Power domain bits in PHY_SYS_POWER are indexed by power_module_name_t and
 * are inverted: 0 powers the domain up.  The PHY domain is index 10.
 */

#define PHY_PWR_MODULE_WIFI_PHY     10
#define PHY_PWR_MODULE_LAST         15

/* Sub-domain identifiers are parent * PM_MODULE_SUB_POWER_DOMAIN_MAX + n
 * (bk7258 hal/sys_types.h, PM_MODULE_SUB_POWER_DOMAIN_MAX == 20), so a
 * sub-domain reduces to its parent by integer division.
 */

#define PHY_PWR_SUB_DOMAIN_STRIDE   20

