Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_phy_osi.c
#define PHY_PWR_STATE_ON            0
#define PHY_PWR_STATE_OFF           1
#define PHY_PWR_STATE_NONE          2

/* AON PMU words the PHY reads for die-specific trim (bk7258
 * soc/aon_pmu_ll.h + aon_pmu_struct.h).
 */

#define PHY_AON_PMU_R7C             (BK7258_AON_PMU_BASE + (0x7c << 2))
#define PHY_AON_PMU_R7D             (BK7258_AON_PMU_BASE + (0x7d << 2))
#define PHY_AON_PMU_R7E             (BK7258_AON_PMU_BASE + (0x7e << 2))

#define PHY_AON_R7D_ADC_CAL_POS     9
#define PHY_AON_R7D_ADC_CAL_MASK    0x3f
#define PHY_AON_R7E_CBCAL_POS       0
#define PHY_AON_R7E_CBCAL_MASK      0x1f

/* Analog shadow register fields, transcribed from bk7258 hal/sys_ll.h.
 * Encoded as index/position/mask triples so the accessors below stay one
 * line each and the transcription can be diffed against the SDK.
 */

#define PHY_ANA_SPIDETEN            0, 4, 0x1
#define PHY_ANA_SPITRIG             0, 19, 0x1
#define PHY_ANA_XTALH_CTUNE         2, 0, 0xff
#define PHY_ANA_ADC_DIV             5, 10, 0x3
#define PHY_ANA_BCAL_START          5, 22, 0x1
#define PHY_ANA_BCAL_EN             5, 23, 0x1
#define PHY_ANA_VBIAS               5, 27, 0x1f
#define PHY_ANA_IOLDO_LP            8, 0, 0x1
#define PHY_ANA_VIOLDOSEL           8, 12, 0x7
#define PHY_ANA_IOCURLIM            8, 15, 0x1
#define PHY_ANA_BGCAL               8, 22, 0x3f
#define PHY_ANA_SPI_LATCH1V         9, 9, 0x1
#define PHY_ANA_VCOREHSEL           9, 16, 0xf
#define PHY_ANA_IOBYAPSSEN          10, 19, 0x1
#define PHY_ANA_APFMS               11, 5, 0x1f
#define PHY_ANA_ALDOSEL             11, 31, 0x1
#define PHY_ANA_DPFMS               12, 8, 0x1f
#define PHY_ANA_DLDOSEL             12, 31, 0x1

/* Vendor default for a pad current limit that is otherwise left alone
 * (bk_phy_adapter.c sys_ll_set_ana_reg8_violdosel_wrapper).
 */

#define PHY_VIOLDOSEL_LIMITED       2
#define PHY_VIOLDOSEL_DEFAULT       4

/* Fallbacks for a sensor read that fails.  Both are raw SARADC codes, not
 * engineering units -- that is what the vendor's own accessors return.
 * The supply code is the one the vendor's driver pins to its 1 V
 * calibration point, so a consumer that ignores the error code sees a
 * stable nominal supply and never applies a droop correction; the
 * temperature code is the midpoint of the vendor's own validity window.
 */

#define PHY_TEMP_RAW_NOMINAL        687
#define PHY_VOLT_RAW_NOMINAL        0x9c7

/* Sensor acquisition, transcribed from the vendor's detectors
 * (bk_idk components/temp_detect/temp_detect.c and volt_detect.c with
 * CONFIG_SOC_BK7236XX set and CONFIG_SDMADC_TEMP unset).  Both run the
 * converter continuously at 203125 Hz with the longest settle, read
 * PHY_ADC_TEMP_BUFFER_SIZE samples, discard the first PHY_ADC_SENSE_SKIP
 * and average what is left; the temperature result is then divided by
 * four.  Channel 7 is the on-die temperature sensor and channel 0 the
 * supply (bk7258 hal/adc_ll.h channel map).
 */

#define PHY_ADC_TEMP_CHANNEL        7
#define PHY_ADC_VOLT_CHANNEL        0
#define PHY_ADC_SENSE_CLK           203125
#define PHY_ADC_SENSE_STEADY        7
#define PHY_ADC_SENSE_SKIP          5
#define PHY_ADC_SENSE_RETRY         3
#define PHY_ADC_SENSE_TIMEOUT_MS    100
#define PHY_ADC_TEMP_SHIFT          2

/* A sample of exactly 2048 is the converter's mid-code and the vendor
 * treats it, like zero, as "no reading" rather than as data.
 */

#define PHY_ADC_SAMPLE_INVALID      2048

/* adc_mode_t and adc_saturate_mode_t (bk_idk driver/hal/hal_adc_types.h).
 * The saturation modes count from "off", so the vendor's mode 3 is 4.
 */

#define PHY_ADC_MODE_CONTINUOUS     3
#define PHY_ADC_SAT_MODE_2          3
#define PHY_ADC_SAT_MODE_3          4

/* SARADC calibration anchors for BK7236XX-class parts, the two codes the
 * vendor's driver pins to 1 V and 2 V (bk_idk driver/saradc/adc_driver.c
 * saradc_val).  Only _saradc_calculate uses them.
 */

#define PHY_SARADC_CODE_1V          0x9c7
#define PHY_SARADC_CODE_2V          0x1358

/* Chip identity, copied from the SDK's bk7258 sys_types.h. */

#define PHY_CHIP_ID_MASK            0xffff0000ul
#define PHY_CHIP_ID_MPW_V2_3        0x22710010ul
#define PHY_CHIP_ID_MPW_V4          0x22c20010ul
#define PHY_CHIP_ID_MP_A            0x23640810ul

/* Temperature detector scaling (bk_idk components/temp_detect/temp_detect.h
 * with CONFIG_SOC_BK7236XX and CONFIG_SDMADC_TEMP off).  Inert here, but the
 * library reads them out of the variable table unconditionally.
 */

#define PHY_ADC_TEMP_10DEG_PER_DBPWR  1
#define PHY_ADC_TEMP_BUFFER_SIZE      (5 + 5)
#define PHY_ADC_TEMP_LSB_PER_10DEG    46
#define PHY_ADC_TEMP_VAL_MIN          10
#define PHY_ADC_TEMP_VAL_MAX          1365
#define PHY_ADC_XTAL_DIST_INITIAL     70
#define PHY_ADC_TEMP_DIST_INITIAL     0

/* Wi-Fi RF config item tags (bk_wifi_types.h) and band indices
 * (modules/wifi_types.h).  Read by paths this image does not run.
 */

#define PHY_RF_CFG_TSSI_ITEM        0x77777777ul
#define PHY_RF_CFG_MODE_ITEM        0x99999999ul
#define PHY_RF_CFG_TSSI_B_ITEM      0xbbbbbbbbul

/* pm_cpu_freq_e / pm_dev_id_e indices (bk_idk include/modules/pm.h). */

#define PHY_PM_CPU_FRQ_60M          1
#define PHY_PM_CPU_FRQ_80M          2
#define PHY_PM_CPU_FRQ_120M         3
#define PHY_PM_CPU_FRQ_320M         5
#define PHY_PM_CPU_FRQ_DEFAULT      7
#define PHY_PM_DEV_ID_PHY           27

/* hardware_chip_version_e (bk_idk include/modules/chip_support.h). */

#define PHY_CHIP_VERSION_A          0
#define PHY_CHIP_VERSION_B          1
#define PHY_CHIP_VERSION_C          2
#define PHY_CHIP_VERSION_DEFAULT    3

/* otp_id_t indices for the calibration items (bk_idk secure_calibration
 * .../driver/otp/hal_otp_types.h).  OTP access below always fails, so these
 * are carried for completeness only.
 */

#define PHY_OTP_MAC_ADDRESS         28
#define PHY_OTP_VDDDIG_BANDGAP      29
#define PHY_OTP_DIA                 30
#define PHY_OTP_SDMADC_CALIBRATION  32
#define PHY_OTP_GADC_TEMPERATURE    35

/* PARAM_XTALH_CTUNE_MASK / PARAM_AUD_DAC_GAIN_MASK for BK7236XX
 * (bk_idk driver/include/bk_private/bk_sys_ctrl.h).
 */

#define PHY_PARAM_XTALH_CTUNE_MASK  0xff
#define PHY_PARAM_AUD_DAC_GAIN_MASK 0x1f

/* Beken return convention: 0 is success, negative is failure. */

#define PHY_OK                      0
#define PHY_FAIL                    (-1)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Scalar spellings the replicated tables need; the SDK gets them from
 * common/bk_include.h, which this port does not carry.
 */

typedef uint8_t  UINT8;
typedef uint16_t UINT16;
typedef uint32_t UINT32;
typedef int32_t  INT32;
typedef int32_t  int32;
typedef uint64_t uint64;
typedef int      bk_err_t;
typedef void     VOID;

