Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_phy_osi.c
/* Replica of phy_os_funcs_t (bk_phy_adapter.h, lines 14..190) with the
 * BK7258 configuration resolved.  Do not reorder.
 */

typedef struct
{
  uint32_t _version;

  void * (*_mpb_reg_api)(void);
  void * (*_crm_reg_api)(void);
  void * (*_riu_reg_api)(void);
  void * (*_mix_funcs)(void);
  uint32_t (*_bk_misc_get_reset_reason)(void);
  void (*_rs_init)(UINT32 channel, INT32 band, UINT32 mode);
  void (*_rs_bypass_mac_init)(UINT32 channel, INT32 band, UINT32 mode);
  void (*_rs_deinit)(void);
  void (*_evm_init)(UINT32 channel, INT32 band, UINT32 bandwidth);
  void (*_evm_bypass_mac_init)(UINT32 frequency, INT32 band,
                               UINT32 bandwidth);

  void (*_nv_phy_reg_set_hook)(void *hook);
  void (*_evm_clear_ke_evt_mac_bit)(void);
  void (*_evm_set_ke_evt_mac_bit)(void);
  void (*_tx_evm_set_chan_ctxt_pop)(void *chan_info);

  UINT32 (*_save_info_item)(UINT32 item, UINT8 *ptr0, UINT8 *ptr1,
                            UINT8 *ptr2);
  UINT32 (*_get_info_item)(UINT32 item, UINT8 *ptr0, UINT8 *ptr1,
                           UINT8 *ptr2);

  void (*_delay)(int32 num);
  void (*_delay_us)(UINT32 us);
  UINT32 (*_ddev_control)(UINT32 handle, UINT32 cmd, VOID *param);
  int (*_bk_wdt_stop)(void);

  bool (*_temp_detect_is_init)(void);
  int (*_temp_detect_deinit)(void);
  int (*_temp_detect_init)(uint32_t init_temperature);
  int (*_temp_detect_get_temperature)(uint32_t *temperature);
  int (*_bk_feature_temp_detect_enable)(void);

  bool (*_ate_is_enabled)(void);
  int (*_volt_single_get_current_voltage)(UINT32 *volt_value);
  float (*_saradc_calculate)(UINT16 adc_val);

  int (*_bk_pm_clock_ctrl_saradc_pwrup)(void);
  int (*_bk_pm_clock_ctrl_phy_pwrup)(void);
  int (*_bk_pm_module_vote_power_ctrl_phy)(int32_t value);
  int (*_bk_pm_module_vote_cpu_freq)(uint32_t module, uint32_t cpu_freq);

  uint32_t (*_aon_pmu_hal_get_chipid)(void);
  uint32_t (*_aon_pmu_drv_bias_cal_get)(void);
  uint32_t (*_aon_pmu_drv_get_adc_cal)(void);

  void (*_sys_ll_set_ana_reg5_adc_div)(uint32_t value);
  uint32_t (*_sys_ll_get_ana_reg5_adc_div)(void);
  void (*_sys_ll_set_ana_reg8_ioldo_lp)(uint32_t value);
  void (*_sys_ll_set_ana_reg9_vcorehsel)(uint32_t value);
  void (*_sys_ll_set_ana_reg9_spi_latch1v)(uint32_t value);
  void (*_sys_ll_set_ana_reg10_iobyapssen)(uint32_t value);
  void (*_sys_ll_set_ana_reg11_aldosel)(uint32_t value);
  void (*_sys_ll_set_ana_reg12_dldosel)(uint32_t value);

  uint32_t (*_sys_drv_cali_dpll)(uint32_t param);
  void (*_sys_drv_set_ana_ioldo_lp)(uint32_t value);
  void (*_sys_drv_set_ana_cb_cal_manu_val)(uint32_t value);
  void (*_sys_drv_set_ana_cb_cal_trig)(uint32_t value);
  void (*_sys_drv_set_ana_cb_cal_manu)(uint32_t value);
  uint32_t (*_sys_drv_analog_set_xtalh_ctune)(uint32_t param);

  void (*_phy_sys_drv_modem_bus_clk_ctrl_on)(void);
  void (*_phy_sys_drv_modem_clk_ctrl_on)(void);

  int (*_bk_adc_read_raw)(uint16_t *buf, uint32_t size, uint32_t timeout);

  int (*_bk_cal_saradc_start)(int32_t adc_channel, int32_t adc_clk,
                              int32_t steady_time);
  int (*_bk_cal_saradc_stop)(int32_t adc_channel);

  int (*_bk_saradc_start)(uint8_t adc_channel, uint32_t sample_rate,
                          uint32_t div, uint32_t saradc_clk,
                          uint32_t saradc_mode, uint32_t saradc_xtal,
                          uint32_t saturate_mode, uint32_t steady_time);
  int (*_bk_saradc_stop)(uint8_t adc_channel);

  int (*_bk_flash_read_bytes)(uint32_t address, uint8_t *user_buf,
                              uint32_t size);
  int (*_bk_flash_erase_sector)(uint32_t address);
  int (*_bk_flash_write_bytes)(uint32_t address, const uint8_t *user_buf,
                               uint32_t size);

  bk_err_t (*_bk_flash_set_protect_type_protect_none)(void);
  bk_err_t (*_bk_flash_set_protect_type_unprotect_last_block)(void);
  uint32_t (*_bk_flash_partition_get_rf_firmware_info)(void);

  int (*_bk_otp_apb_read)(uint32_t item, uint8_t *buf, uint32_t size);
  int (*_bk_otp_apb_update)(uint32_t item, uint8_t *buf, uint32_t size);

  void (*_log)(int level, char *tag, const char *fmt, ...);
  void (*_log_raw)(int level, char *tag, const char *fmt, ...);
  uint32_t (*_get_time)(void);

  void (*_bk_printf)(const char *fmt, ...);
  void (*_bk_null_printf)(const char *fmt, ...);
  void (*_shell_set_log_level)(int level);

  void *(*_os_malloc)(uint32_t size);
  void (*_os_free)(void *mem_ptr);
  int32_t (*_os_memcmp)(const void *s, const void *s1, uint32_t n);
  void *(*_os_memset)(void *b, int c, UINT32 len);
  void *(*_os_zalloc)(size_t size);
  UINT32 (*_os_strtoul)(const char *nptr, char **endptr, int base);
  int (*_os_strcasecmp)(const char *s1, const char *s2);
  int32_t (*_os_strcmp)(const char *s1, const char *s2);
  int32_t (*_os_strncmp)(const char *s1, const char *s2, const uint32_t n);
  void *(*_os_memcpy)(void *out, const void *in, uint32_t n);

  void (*_rtos_assert)(uint32_t exp);
  void (*_rtos_enable_int)(uint32_t int_level);
  uint32_t (*_rtos_disable_int)(void);
  uint32_t (*_rtos_get_time)(void);
  int (*_rtos_start_timer)(void *timer);
  int (*_rtos_init_timer)(void *timer, uint32_t time_ms, void *function,
                          void *arg);
  int (*_rtos_deinit_timer)(void *timer);
  bk_err_t (*_rtos_reload_timer)(void *timer);
  int (*_rtos_delay_milliseconds)(uint32_t num_ms);

  /* BK7256 (RISC-V) only; NULL on this part, exactly as the vendor
   * leaves them when CONFIG_SOC_BK7256XX is not set.
   */

  uint64 (*_riscv_get_mtimer)(void);

  void (*_sys_drv_set_ana_vctrl_sysldo)(uint32_t value);
  uint32_t (*_sys_drv_analog_reg3_set)(uint32_t value);
  uint32_t (*_sys_drv_analog_reg2_set)(uint32_t value);
  void (*_sys_drv_flash_cksel)(uint32_t value);
  void (*_sys_drv_set_ana_scal_en)(uint32_t value);
  void (*_sys_drv_set_ana_gadc_buf_ictrl)(uint32_t value);
  void (*_sys_drv_set_ana_gadc_cmp_ictrl)(uint32_t value);
  void (*_sys_drv_set_ana_vtempsel)(uint32_t value);
  void (*_sys_drv_set_ana_vref_sel)(uint32_t value);
  void (*_sys_drv_set_ana_vhsel_ldodig)(uint32_t value);
  void (*_sys_drv_set_ana_pwd_gadc_buf)(uint32_t value);
  uint32_t (*_sys_drv_set_bgcalm)(uint32_t value);
  uint32_t (*_sys_drv_get_bgcalm)(void);
  uint32_t (*_sys_drv_set_vdd_value)(uint32_t value);
  uint32_t (*_sys_drv_get_vdd_value)(void);

  uint32_t (*_aon_pmu_hal_get_reg0x7c)(void);
  uint32_t (*_aon_pmu_get_device_id)(void);

