Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_phy_osi.c
  int (*_gpio_dev_unmap)(uint32_t gpio_id);
  int (*_gpio_dev_map_txen)(uint32_t gpio_id);
  int (*_bk_gpio_pull_down)(uint32_t gpio_id);

  uint32_t (*_bk_get_hardware_chip_id_version)(void);
  int (*_bk_efuse_read_byte)(uint8_t addr, uint8_t *data);

  /* BK7239/BK7286 only; NULL on this part. */

  void (*_sys_ll_set_ana_reg0_cksel)(uint32_t value);
  void (*_sys_ll_set_ana_reg0_dsptrig)(uint32_t value);
  void (*_sys_ll_set_ana_reg8_t_vanaldosel)(uint32_t value);
  void (*_sys_ll_set_ana_reg8_r_vanaldosel)(uint32_t value);
  void (*_sys_ll_set_ana_reg9_vcorelsel)(uint32_t value);

  void (*_bk_set_g_saradc_flag)(UINT8 flag);

  bk_err_t (*_ble_in_dut_mode)(void);
  uint8_t (*_get_tx_pwr_idx)(void);
  void (*_txpwr_max_set_bt_polar)(void);
  void (*_ble_tx_testmode_retrig)(void);

  int (*_gpio_dev_map_rxen)(uint32_t gpio_id);

  uint8_t (*_bk_phy_get_wifi_media_mode_config)(void);
  int (*_bk_feature_save_rfcali_to_otp_enable)(void);
  int (*_bk_otp_ahb_read)(uint32_t item, uint8_t *buf, uint32_t size);
  int (*_bk_otp_ahb_update)(uint32_t item, uint8_t *buf, uint32_t size);
  int (*_bk_get_otp_ahb_rfcali_item)(void);
  void (*_sys_ll_set_ana_reg8_violdosel)(uint32_t value);
  void (*_sys_ll_set_ana_reg8_iocurlim)(uint32_t value);
  int (*_bk_feature_phy_log_enable)(void);
} phy_os_funcs_t;

/* Replica of phy_os_variable_t (bk_phy_adapter.h, lines 193..282).  The
 * chip-id block is the generic branch: not BK7256XX, not BK7239XX/BK7286XX.
 * _cmd_ble_rf_bit_set/_clr are present because this part is not BK7231.
 */

typedef struct
{
  uint32_t _saradc_autotest;

  uint32_t _rf_cfg_tssi_item;
  uint32_t _rf_cfg_mode_item;
  uint32_t _rf_cfg_tssi_b_item;

  uint32_t _cmd_tl410_clk_pwr_up;
  uint32_t _pwd_ble_clk_bit;

  uint32_t _pm_cpu_frq_60m;
  uint32_t _pm_cpu_frq_80m;
  uint32_t _pm_cpu_frq_120m;
  uint32_t _pm_cpu_frq_320m;
  uint32_t _pm_cpu_frq_default;

  uint32_t _pm_dev_id_phy;

  uint32_t _dd_dev_type_ble;
  uint32_t _dd_dev_type_sctrl;
  uint32_t _dd_dev_type_icu;
  uint32_t _dd_dev_type_flash;

  uint32_t _chip_version_a;
  uint32_t _chip_version_b;
  uint32_t _chip_version_c;
  uint32_t _chip_version_default;

  uint32_t _pm_chip_id_mask;
  uint32_t _pm_chip_id_mpw_v2_3;
  uint32_t _pm_chip_id_mpw_v4;
  uint32_t _pm_chip_id_mp_a;

  uint32_t _cmd_get_device_id;
  uint32_t _cmd_sctrl_ble_powerdown;
  uint32_t _cmd_sctrl_ble_powerup;

  uint32_t _cmd_ble_rf_bit_set;
  uint32_t _cmd_ble_rf_bit_clr;

  uint32_t _cmd_sctrl_get_vdd_value;
  uint32_t _cmd_sctrl_set_vdd_value;

  int32_t  _param_xtalh_ctune_mask;
  uint32_t _param_aud_dac_gain_mask;

  uint32_t _pm_power_module_state_on;
  uint32_t _pm_power_module_state_off;
  uint32_t _pm_power_module_state_none;

  uint32_t _adc_temp_10degree_per_dbpwr;
  uint32_t _adc_temp_buffer_size;
  uint32_t _adc_temp_lsb_per_10degree;
  uint32_t _adc_temp_val_min;
  uint32_t _adc_temp_val_max;
  uint32_t _adc_xtal_dist_intial_val;
  uint32_t _adc_temp_dist_intial_val;

  uint32_t _ieee80211_band_2ghz;
  uint32_t _ieee80211_band_5ghz;
  uint32_t _ieee80211_band_6ghz;
  uint32_t _ieee80211_band_60ghz;
  uint32_t _ieee80211_num_bands;

  uint32_t _otp_mac_address;
  uint32_t _otp_vdddig_bandgap;
  uint32_t _otp_dia;
  uint32_t _otp_gadc_temperature;
  uint32_t _otp_sdmadc_calibration;
} phy_os_variable_t;

/* Replica of rf_control_funcs_t / rf_variable_t (bk_rf_adapter.h).  The
 * layout was confirmed against the shipped rf_module_vote_ctrl, which loads
 * table offsets 0/4 (modem clocks), 16/20 (interrupt lock), 32/36 (LDO
 * pulse-skip trim) and 40 (power vote), and variable offsets 0/4 (off/on)
 * and 12 (the RF sub-domain name).
 */

typedef struct
{
  uint32_t (*_sys_drv_modem_bus_clk_ctrl)(bool clk_en);
  uint32_t (*_sys_drv_modem_clk_ctrl)(bool clk_en);
  void (*_phy_exit_dsss_only)(void);
  void (*_phy_enter_dsss_only)(void);
  uint32_t (*_rtos_disable_int)(void);
  void (*_rtos_enable_int)(uint32_t int_level);
  void (*_rwnx_cal_mac_sleep_rc_recover)(void);
  void (*_sys_drv_module_power_ctrl)(unsigned int module,
                                     uint32_t power_state);
  void (*_sys_drv_set_ana_reg11_apfms)(uint32_t value);
  void (*_sys_drv_set_ana_reg12_dpfms)(uint32_t value);
  bk_err_t (*_bk_pm_module_vote_power_ctrl)(unsigned int module,
                                            uint32_t power_state);
} rf_control_funcs_t;

typedef struct
{
  uint32_t _pm_power_module_state_off;
  uint32_t _pm_power_module_state_on;
  uint32_t _pm_power_module_name_phy;
  uint32_t _pm_power_module_name_rf;
} rf_variable_t;

/* The library hands _rtos_init_timer a pointer to its own beken_timer_t
 * (bk_idk include/os/os.h): three words, of which 'handle' is the OS
 * cookie.  Replicated here so the cookie can hold a NuttX work item
 * without writing past the block the caller owns.
 */

struct phy_beken_timer_s
{
  void  *handle;
  void (*function)(void *arg);
  void  *arg;
};

struct phy_timer_ctx_s
{
  struct work_s             work;
  struct phy_beken_timer_s *owner;
  uint32_t                  ms;
  bool                      running;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Closed bluetooth controller entries used from the PHY table.  Each was
 * confirmed present in bk_idk components/bk_libs/bk7258/libs with
 * arm-none-eabi-nm before being declared here; nothing is declared on
 * faith, because a missing symbol is a link failure.
 */

extern int  ble_in_dut_mode(void);
extern uint8_t get_tx_pwr_idx(void);
extern void txpwr_max_set_bt_polar(void);
extern void bluetooth_rf_test_mode_retrig(void);

/* Closed PHY entries.  rwnx_cal_mac_sleep_rc_recover lives in libbk_phy's
 * bk7236_cal.c and is already linked; the RF arbiter calls it directly as
 * well as through this table.
 */

extern void rwnx_cal_mac_sleep_rc_recover(void);

/* The closed adapter entry points.  rf_adapter_init takes two arguments,
 * not one: funcs and vars, the same shape as phy_adapter_init.
 */

extern void phy_adapter_init(const void *phy_funcs, const void *phy_vars);
extern void rf_adapter_init(const void *rf_funcs, const void *rf_vars);
extern void rf_cntrl_init(void);

/* Interrupt lock shims shared with the bluetooth controller
 * (bk7258_ble_shim.c); not redefined here.
 */

