Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_phy_osi.c
extern uint32_t rtos_disable_int(void);
extern void rtos_enable_int(uint32_t flags);
extern void delay_us(uint32_t us);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Where the library's per-channel register-set callback is parked.  Kept
 * because the vendor keeps it, and because a pointer the library handed us
 * is worth having visible in a memory dump; nothing in this image calls it
 * (see phy_osi_nv_reg_set_hook).
 */

static void *g_phy_nv_reg_hook;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: phy_ana_write / phy_ana_field
 *
 * Description:
 *   Analog shadow register access.  The words at PHY_SYS_ANA_REG(n) are not
 *   ordinary registers: a write is pushed to the analog island over an
 *   internal SPI link, and bit n of PHY_SYS_ANA_BUSY stays set until that
 *   transfer drains.  Issuing the next write before it clears loses it, so
 *   every write polls.  Reads come straight back from the shadow and need
 *   no handshake.  Same protocol as aud_ana_write() in bk7258_audio.c.
 *
 ****************************************************************************/

static void phy_ana_write(int n, uint32_t val)
{
  uint32_t budget = 100000;

  putreg32(val, PHY_SYS_ANA_REG(n));

  while ((getreg32(PHY_SYS_ANA_BUSY) & (1u << n)) != 0)
    {
      if (--budget == 0)
        {
          return;
        }
    }
}

static void phy_ana_field(int n, uint32_t pos, uint32_t mask, uint32_t val)
{
  uint32_t reg = getreg32(PHY_SYS_ANA_REG(n));

  reg &= ~(mask << pos);
  reg |= (val & mask) << pos;
  phy_ana_write(n, reg);
}

static uint32_t phy_ana_get_field(int n, uint32_t pos, uint32_t mask)
{
  return (getreg32(PHY_SYS_ANA_REG(n)) >> pos) & mask;
}

/****************************************************************************
 * Name: phy_power_domain_ctrl
 *
 * Description:
 *   Drive one power-domain bit in the system block.  Sub-domain identifiers
 *   fold onto their parent, which is what the SDK's power manager does once
 *   its vote counting settles: the silicon has one gate per parent domain.
 *   Bits are inverted, so clearing powers up.
 *
 ****************************************************************************/

static int phy_power_domain_ctrl(unsigned int module, uint32_t power_state)
{
  uint32_t bit;

  if (module >= PHY_PWR_SUB_DOMAIN_STRIDE)
    {
      module /= PHY_PWR_SUB_DOMAIN_STRIDE;
    }

  if (module > PHY_PWR_MODULE_LAST)
    {
      return PHY_FAIL;
    }

  if (power_state == PHY_PWR_STATE_NONE)
    {
      return PHY_OK;
    }

  bit = 1u << module;

  modifyreg32(PHY_SYS_POWER,
              power_state == PHY_PWR_STATE_ON ? bit : 0,
              power_state == PHY_PWR_STATE_ON ? 0 : bit);
  return PHY_OK;
}

/****************************************************************************
 * Name: phy_modem_clk_ctrl / phy_modem_bus_clk_ctrl
 *
 * Description:
 *   The modem (PHY) clock gate.  This part has no separate modem bus clock
 *   -- the vendor's own bk7258 sys_hal_modem_bus_clk_ctrl() is an empty
 *   function -- so only the functional gate is real.
 *
 ****************************************************************************/

static uint32_t phy_modem_clk_ctrl(bool clk_en)
{
  modifyreg32(PHY_SYS_CLK_EN,
              clk_en ? 0 : PHY_CKEN_PHY,
              clk_en ? PHY_CKEN_PHY : 0);
  return PHY_OK;
}

static uint32_t phy_modem_bus_clk_ctrl(bool clk_en)
{
  UNUSED(clk_en);
  return PHY_OK;
}

/****************************************************************************
 * Name: phy_osi_wifi_* / phy_osi_no_wifi_*
 *
 * Description:
 *   Wi-Fi is not built into this image.  The four register-window getters
 *   return NULL, which is what the vendor returns with CONFIG_WIFI_ENABLE
 *   off, and the media-mode probe reports "off".  The point of answering
 *   rather than leaving them NULL is that the honest answer to "is Wi-Fi
 *   holding the radio" must be no, never an unmapped call.
 *
 ****************************************************************************/

static void *phy_osi_null_reg_api(void)
{
  return NULL;
}

static uint8_t phy_osi_wifi_media_mode(void)
{
  return 0;
}

/****************************************************************************
 * Name: phy_osi_nv_reg_set_hook
 *
 * Description:
 *   Store the PHY register-set callback the library offers, and that is
 *   the whole implementation.  The vendor binds this to
 *   bk_phy_set_nv_reg_hook(), which lives in libwifi.a and does the same
 *   thing: it parks the pointer so the Wi-Fi NV parameter code can later
 *   ask the PHY to re-apply per-channel, per-bandwidth register values.
 *   No Wi-Fi in this image means no one ever asks, so parking it is not a
 *   stub -- it is the complete behaviour for this configuration.
 *
 *   This entry must not be NULL, and that is not a style preference.  It
 *   is the whole reason bk_cal_if_init took a UsageFault:
 *
 *     nv_init:  ldr r3, [g_phy_funcs_t]
 *               ldr r3, [r3, #44]      @ 0x2c, this entry
 *               bx  r3
 *
 *   calibration_main calls nv_init as its third statement.  A bx loads bit
 *   0 of its target into EPSR.T, so a null pointer clears the Thumb bit
 *   and the core raises INVSTATE instead of executing -- which is why a
 *   null function pointer surfaces here as UFSR.INVSTATE (CFSR 0x00020000)
 *   and not as any kind of memory fault, and why "it is INVSTATE, so it is
 *   not a null pointer" is the wrong inference.  The observed R3 of zero
 *   is the ldr above.
 *
 *   The trap was that the vendor leaves this entry NULL too, under
 *   #if CONFIG_WIFI_ENABLE ... #else in bk_phy_adapter.c, and this port
 *   copied that branch correctly.  What does not carry over is the other
 *   half of the vendor's Wi-Fi-off configuration: with Wi-Fi off the SDK
 *   links libcom_phy.a, whose nv_init is a bare "bx lr" and never reaches
 *   this entry.  This board links libbk_phy.a ahead of it -- the Wi-Fi
 *   build of the same objects -- so the Wi-Fi nv_init is the one that
 *   wins, calling a hook the Wi-Fi-off table never filled in.  Filling it
 *   in is the smaller of the two ways to make those halves agree; the
 *   other is to reorder the archives, which would swap the provider of
 *   every duplicate symbol in them and is not a change to make blind.
 *
 ****************************************************************************/

static void phy_osi_nv_reg_set_hook(void *hook)
{
  g_phy_nv_reg_hook = hook;
}

/****************************************************************************
 * Name: phy_osi_get_reset_reason
 *
 * Description:
 *   The vendor returns a boot-cause code latched by its own startup code.
 *   This port does not latch one, and every consumer of it in the library
 *   only distinguishes "cold boot" from "software restart" to decide
 *   whether calibration may be skipped.  Reporting 0 (cold boot) makes it
 *   redo the work, which is the safe direction.
 *
 ****************************************************************************/

