Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_phy_osi.c
static uint32_t phy_osi_get_reset_reason(void)
{
  return 0;
}

/****************************************************************************
 * Name: phy_osi_delay / phy_osi_delay_us
 *
 * Description:
 *   _delay is the vendor's calibrated-by-eye spin (an inner loop of 100 per
 *   count), used inside analog settling sequences that run with interrupts
 *   masked; keeping it a spin rather than a sleep preserves that.
 *
 ****************************************************************************/

static void phy_osi_delay(int32 num)
{
  volatile int32 i;
  volatile int32 j;

  for (i = 0; i < num; i++)
    {
      for (j = 0; j < 100; j++)
        {
        }
    }
}

static void phy_osi_delay_us(UINT32 us)
{
  up_udelay(us);
}

/****************************************************************************
 * Name: phy_osi_ddev_control
 *
 * Description:
 *   Stub.  This is the entry into Beken's legacy driver-model dispatcher,
 *   which the PHY uses only on the pre-BK7236 parts to reach the system
 *   controller; on this part the same work arrives through the dedicated
 *   entries above.  There is no dispatcher in this port, so the handles and
 *   command codes in the variable table are left at zero rather than
 *   guessed -- if this is ever implemented, they must be recomputed from
 *   the SDK's configuration-dependent enums first.
 *
 ****************************************************************************/

static UINT32 phy_osi_ddev_control(UINT32 handle, UINT32 cmd, VOID *param)
{
  UNUSED(handle);
  UNUSED(cmd);
  UNUSED(param);
  return 0;
}

/****************************************************************************
 * Name: phy_osi_wdt_stop
 *
 * Description:
 *   The library asks for this before long calibration runs so a watchdog
 *   reset cannot land in the middle of one.  This port cannot disable the
 *   always-on watchdog without also losing the reset path that recovers a
 *   genuinely hung board, so the closest safe equivalent is taken: re-arm
 *   it, which restarts the full window at exactly the moment the library
 *   says the long operation begins.  Feeding and arming are the same
 *   operation on this part.
 *
 ****************************************************************************/

static int phy_osi_wdt_stop(void)
{
  bk7258_wdt_arm(BK7258_WDT_PERIOD_RUN);
  return PHY_OK;
}

/****************************************************************************
 * Name: phy_osi_sense
 *
 * Description:
 *   One sensor acquisition, the shape both of the vendor's detectors use:
 *   run the converter continuously on one analog channel, take a fixed
 *   batch, drop the leading samples that were taken while the input was
 *   still settling, and average the rest.  Samples of 0 and of the
 *   mid-code are dropped as well -- the vendor discards both, its comment
 *   saying the converter can return 0 in power-save mode.
 *
 *   The average is a raw converter code, not an engineering unit; that is
 *   what the vendor's accessors hand back and what the library expects.
 *
 * Returned Value:
 *   The averaged code, or 0 when the batch produced nothing usable, which
 *   is how the vendor signals the same thing.
 *
 ****************************************************************************/

static uint32_t phy_osi_sense(uint8_t channel, uint8_t saturate)
{
  uint16_t raw[PHY_ADC_TEMP_BUFFER_SIZE];
  uint32_t count = 0;
  uint32_t sum = 0;
  uint32_t i;
  int ret;

  ret = bk7258_saradc_start(channel, PHY_ADC_MODE_CONTINUOUS,
                            bk7258_saradc_div(PHY_ADC_SENSE_CLK),
                            saturate, PHY_ADC_SENSE_STEADY, 0, 0);
  if (ret < 0)
    {
      return 0;
    }

  ret = bk7258_saradc_read(raw, PHY_ADC_TEMP_BUFFER_SIZE,
                           PHY_ADC_SENSE_TIMEOUT_MS);
  bk7258_saradc_stop();

  if (ret < 0)
    {
      return 0;
    }

  for (i = PHY_ADC_SENSE_SKIP; i < PHY_ADC_TEMP_BUFFER_SIZE; i++)
    {
      if (raw[i] != 0 && raw[i] != PHY_ADC_SAMPLE_INVALID)
        {
          sum += raw[i];
          count++;
        }
    }

  return count == 0 ? 0 : sum / count;
}

/****************************************************************************
 * Name: phy_osi_temp_detect_* / phy_osi_get_voltage / phy_osi_temp_enable
 *
 * Description:
 *   Single-shot readings of the on-die temperature sensor and of the
 *   supply, both through the SARADC driver.  Real measurements: the
 *   library's calibration solves for transmit trim from these, and feeding
 *   it constants is how it ends up trimming against a temperature that
 *   never moves.
 *
 *   Each is retried the vendor's three times and range-checked against the
 *   vendor's own validity window before being accepted.  A read that never
 *   lands reports failure and leaves the caller's variable at a nominal
 *   code, so a consumer that ignores the error code still sees a plausible
 *   number -- but the error code is the useful part, because the
 *   library's temperature correction is skipped entirely when this fails,
 *   which is the safe outcome.
 *
 *   Temperature is divided by four before the range check, exactly as the
 *   vendor does for this part; the resulting code is still not degrees.
 *   The code-to-degree anchor lives in factory calibration data this port
 *   cannot reach, so the library will compare this reading against its own
 *   default reference tag rather than against a per-unit one.
 *
 *   _bk_feature_temp_detect_enable still reports the feature disabled.
 *   That flag does not gate the reading above -- calibration calls
 *   _temp_detect_get_temperature directly -- it gates the vendor's
 *   periodic re-trim daemon, and this port runs no such daemon.  Claiming
 *   otherwise would promise drift tracking that does not happen.  The
 *   remaining entries keep mirroring the vendor's disabled-build stubs.
 *
 ****************************************************************************/

static bool phy_osi_temp_detect_is_init(void)
{
  return true;
}

static int phy_osi_temp_detect_init(uint32_t init_temperature)
{
  UNUSED(init_temperature);
  return PHY_OK;
}

