Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_phy_osi.c
static int phy_osi_temp_detect_deinit(void)
{
  return PHY_OK;
}

static int phy_osi_temp_detect_get(uint32_t *temperature)
{
  uint32_t value = 0;
  int retry;

  if (temperature == NULL)
    {
      return PHY_FAIL;
    }

  bk7258_saradc_tempsensor(true);

  for (retry = 0; retry < PHY_ADC_SENSE_RETRY; retry++)
    {
      value = phy_osi_sense(PHY_ADC_TEMP_CHANNEL, PHY_ADC_SAT_MODE_2) >>
              PHY_ADC_TEMP_SHIFT;

      if (value > PHY_ADC_TEMP_VAL_MIN && value < PHY_ADC_TEMP_VAL_MAX)
        {
          break;
        }
    }

  bk7258_saradc_tempsensor(false);

  if (value <= PHY_ADC_TEMP_VAL_MIN || value >= PHY_ADC_TEMP_VAL_MAX)
    {
      *temperature = PHY_TEMP_RAW_NOMINAL;
      return PHY_FAIL;
    }

  *temperature = value;
  return PHY_OK;
}

static int phy_osi_temp_detect_enabled(void)
{
  return 0;
}

static int phy_osi_get_voltage(UINT32 *volt_value)
{
  uint32_t value = 0;
  int retry;

  if (volt_value == NULL)
    {
      return PHY_FAIL;
    }

  for (retry = 0; retry < PHY_ADC_SENSE_RETRY; retry++)
    {
      value = phy_osi_sense(PHY_ADC_VOLT_CHANNEL, PHY_ADC_SAT_MODE_2);
      if (value > PHY_ADC_TEMP_VAL_MIN)
        {
          break;
        }
    }

  if (value <= PHY_ADC_TEMP_VAL_MIN)
    {
      *volt_value = PHY_VOLT_RAW_NOMINAL;
      return PHY_FAIL;
    }

  *volt_value = value;
  return PHY_OK;
}

/****************************************************************************
 * Name: phy_osi_saradc_calculate
 *
 * Description:
 *   Raw SARADC code to volts, the BK7236XX-family formula: the driver's two
 *   calibration codes bracket 1 V and 2 V, so the code maps linearly onto
 *   that interval.  Transcribed from bk_idk driver/saradc/adc_driver.c.
 *   Kept real rather than stubbed because it is pure arithmetic -- it needs
 *   no hardware -- so whatever code the library feeds it converts the same
 *   way it would on the vendor's build.
 *
 ****************************************************************************/

static float phy_osi_saradc_calculate(UINT16 adc_val)
{
  float voltage;

  voltage = (float)((int32_t)adc_val - PHY_SARADC_CODE_1V);
  voltage = voltage / (float)(PHY_SARADC_CODE_2V - PHY_SARADC_CODE_1V) + 1;

  if (voltage < 0)
    {
      voltage = 0.0f;
    }

  return voltage;
}

/****************************************************************************
 * Name: phy_osi_pm_*
 *
 * Description:
 *   Clock and power votes.  The SARADC gate is real: calibration opens it
 *   once up front and expects the converter reachable from then on.  The
 *   CPU-frequency vote is a no-op because this port runs at a fixed clock
 *   and never lowers it -- reporting success keeps the library's own
 *   bookkeeping consistent without promising a frequency change that will
 *   not happen.
 *
 *   The PHY clock and power entries are real: they are on the radio path,
 *   not the sleep path.  The vendor reference-counts these votes in its
 *   power manager; with BLE as the only radio user in this image there is
 *   exactly one voter, so writing the gate directly is equivalent.
 *
 ****************************************************************************/

static int phy_osi_pm_saradc_pwrup(void)
{
  return bk7258_saradc_pwrup() < 0 ? PHY_FAIL : PHY_OK;
}

static int phy_osi_pm_phy_pwrup(void)
{
  phy_modem_clk_ctrl(true);
  return PHY_OK;
}

static int phy_osi_pm_vote_power_phy(int32_t value)
{
  return phy_power_domain_ctrl(PHY_PWR_MODULE_WIFI_PHY, (uint32_t)value);
}

static int phy_osi_pm_vote_cpu_freq(uint32_t module, uint32_t cpu_freq)
{
  UNUSED(module);
  UNUSED(cpu_freq);
  return PHY_OK;
}

/****************************************************************************
 * Name: phy_osi_get_chipid / phy_osi_bias_cal / phy_osi_adc_cal
 *
 * Description:
 *   Die-specific trim latched by the AON PMU at reset.  Real reads: these
 *   are plain always-on registers, they need no driver, and the values pick
 *   the correct silicon-revision workarounds inside the library.  Field
 *   positions are from the SDK's bk7258 aon_pmu_struct.h.
 *
 ****************************************************************************/

static uint32_t phy_osi_get_chipid(void)
{
  return getreg32(PHY_AON_PMU_R7C);
}

static uint32_t phy_osi_bias_cal_get(void)
{
  return (getreg32(PHY_AON_PMU_R7E) >> PHY_AON_R7E_CBCAL_POS) &
         PHY_AON_R7E_CBCAL_MASK;
}

static uint32_t phy_osi_adc_cal_get(void)
{
  return (getreg32(PHY_AON_PMU_R7D) >> PHY_AON_R7D_ADC_CAL_POS) &
         PHY_AON_R7D_ADC_CAL_MASK;
}

/****************************************************************************
 * Name: phy_osi_set_ana_* / phy_osi_get_ana_*
 *
 * Description:
 *   One-line analog shadow accessors, each a direct transcription of the
 *   matching sys_ll_set_ana_regN_* inline from the SDK's bk7258 sys_ll.h.
 *   Every write goes through the busy handshake in phy_ana_field().
 *
 ****************************************************************************/

static void phy_osi_set_adc_div(uint32_t value)
{
  phy_ana_field(PHY_ANA_ADC_DIV, value);
}

static uint32_t phy_osi_get_adc_div(void)
{
  return phy_ana_get_field(PHY_ANA_ADC_DIV);
}

static void phy_osi_set_ioldo_lp(uint32_t value)
{
  phy_ana_field(PHY_ANA_IOLDO_LP, value);
}

/* The driver-level spelling of the same field normalises first: the SDK's
 * sys_hal_set_ioldo_lp() documents 0 as high-power and anything else as
 * low-power, so a caller passing 2 must not land on 0 after masking.
 */

static void phy_osi_drv_set_ioldo_lp(uint32_t value)
{
  phy_ana_field(PHY_ANA_IOLDO_LP, !!value);
}

static void phy_osi_set_vcorehsel(uint32_t value)
{
  phy_ana_field(PHY_ANA_VCOREHSEL, value);
}

static void phy_osi_set_spi_latch1v(uint32_t value)
{
  phy_ana_field(PHY_ANA_SPI_LATCH1V, value);
}

static void phy_osi_set_aldosel(uint32_t value)
{
  phy_ana_field(PHY_ANA_ALDOSEL, value);
}

static void phy_osi_set_dldosel(uint32_t value)
{
  phy_ana_field(PHY_ANA_DLDOSEL, value);
}

static void phy_osi_set_apfms(uint32_t value)
{
  phy_ana_field(PHY_ANA_APFMS, value);
}

static void phy_osi_set_dpfms(uint32_t value)
{
  phy_ana_field(PHY_ANA_DPFMS, value);
}

static void phy_osi_set_cb_cal_manu(uint32_t value)
{
  phy_ana_field(PHY_ANA_BCAL_EN, value);
}

static void phy_osi_set_cb_cal_trig(uint32_t value)
{
  phy_ana_field(PHY_ANA_BCAL_START, value);
}

