Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_phy_osi.c
static void phy_osi_set_cb_cal_manu_val(uint32_t value)
{
  phy_ana_field(PHY_ANA_VBIAS, value);
}

static uint32_t phy_osi_set_xtalh_ctune(uint32_t param)
{
  phy_ana_field(PHY_ANA_XTALH_CTUNE, param);
  return PHY_OK;
}

/****************************************************************************
 * Name: phy_osi_set_iobyapssen / phy_osi_set_violdosel
 *
 * Description:
 *   Both change an IO LDO setting that is latched only while spi_latch1v is
 *   asserted, so the vendor brackets them with that bit and this port does
 *   the same.  The zero case restores the reset-default current limit
 *   rather than clearing the field, again matching the vendor.
 *
 ****************************************************************************/

static void phy_osi_set_iobyapssen(uint32_t value)
{
  phy_ana_field(PHY_ANA_SPI_LATCH1V, 1);
  phy_ana_field(PHY_ANA_IOBYAPSSEN, value ? 1 : 0);
  phy_ana_field(PHY_ANA_SPI_LATCH1V, 0);
}

static void phy_osi_set_violdosel(uint32_t flag)
{
  phy_ana_field(PHY_ANA_SPI_LATCH1V, 1);
  phy_ana_field(PHY_ANA_VIOLDOSEL,
                flag ? PHY_VIOLDOSEL_LIMITED : PHY_VIOLDOSEL_DEFAULT);
  phy_ana_field(PHY_ANA_SPI_LATCH1V, 0);
}

static void phy_osi_set_iocurlim(uint32_t value)
{
  phy_ana_field(PHY_ANA_IOCURLIM, value);
}

/****************************************************************************
 * Name: phy_osi_cali_dpll
 *
 * Description:
 *   Re-run the DPLL band search.  The sequence is the vendor's
 *   sys_drv_cali_dpll(): drop the SPI trigger, wait, raise it again while
 *   the unlock detector is masked, wait for the loop to settle, then unmask
 *   the detector.  The waits are the vendor's two magnitudes -- roughly
 *   10 us and 200 us -- and the whole sequence runs with interrupts masked
 *   so nothing can land between the trigger and the settle.  param selects
 *   the longer pair, which the vendor uses on the resume-from-sleep path.
 *
 ****************************************************************************/

static uint32_t phy_osi_cali_dpll(uint32_t param)
{
  irqstate_t flags = up_irq_save();

  phy_ana_field(PHY_ANA_SPITRIG, 0);
  up_udelay(param ? 20 : 10);

  phy_ana_field(PHY_ANA_SPITRIG, 1);
  phy_ana_field(PHY_ANA_SPIDETEN, 0);
  up_udelay(param ? 340 : 200);

  phy_ana_field(PHY_ANA_SPIDETEN, 1);

  up_irq_restore(flags);
  return PHY_OK;
}

/****************************************************************************
 * Name: phy_osi_set_bgcalm / phy_osi_get_bgcalm
 *
 * Description:
 *   Bandgap trim.  Writing it needs the 1 V latch held, reading it does
 *   not; both follow the SDK's sys_hal_*_bgcalm().
 *
 ****************************************************************************/

static uint32_t phy_osi_set_bgcalm(uint32_t value)
{
  phy_ana_field(PHY_ANA_SPI_LATCH1V, 1);
  phy_ana_field(PHY_ANA_BGCAL, value);
  phy_ana_field(PHY_ANA_SPI_LATCH1V, 0);
  return PHY_OK;
}

static uint32_t phy_osi_get_bgcalm(void)
{
  return phy_ana_get_field(PHY_ANA_BGCAL);
}

/****************************************************************************
 * Name: phy_osi_set_vdd_value / phy_osi_get_vdd_value
 *
 * Description:
 *   Digital core voltage select.  The SDK reaches the same field through
 *   its high-voltage control helper; the register write is identical.
 *
 ****************************************************************************/

static uint32_t phy_osi_set_vdd_value(uint32_t value)
{
  phy_ana_field(PHY_ANA_VCOREHSEL, value);
  return PHY_OK;
}

static uint32_t phy_osi_get_vdd_value(void)
{
  return phy_ana_get_field(PHY_ANA_VCOREHSEL);
}

/****************************************************************************
 * Name: phy_osi_modem_bus_clk_on / phy_osi_modem_clk_on
 ****************************************************************************/

static void phy_osi_modem_bus_clk_on(void)
{
  phy_modem_bus_clk_ctrl(true);
}

static void phy_osi_modem_clk_on(void)
{
  phy_modem_clk_ctrl(true);
}

/****************************************************************************
 * Name: phy_osi_adc_read_raw / phy_osi_saradc_*
 *
 * Description:
 *   The converter acquisition the transmit calibration runs on.  It opens
 *   the analog transmit-power detector on channel 8 at 2.6 MHz with the
 *   longest settle, then repeatedly asks for batches of 32 samples and
 *   takes a trimmed mean of each -- so a failed read here does not crash
 *   it, it just yields a detector reading of zero and a transmit trim
 *   solved against nothing.  That is what these entries used to do.
 *
 *   Both channel and clock arrive from the library and are passed through
 *   rather than assumed, and the mode is the vendor's continuous mode with
 *   its saturation mode 3, which is what bk_cal_saradc_start() configures.
 *
 *   The second pair is the vendor's autotest hook.  It is wired to the
 *   same driver for completeness, converting its arguments the way
 *   bk_saradc_start() does, but nothing calls it: _saradc_autotest is 0 in
 *   the variable table below.  Its source-clock argument is ignored for
 *   the same reason the vendor's own autotest path ignores it -- that path
 *   forces the 26 MHz crystal too.
 *
 ****************************************************************************/

static int phy_osi_adc_read_raw(uint16_t *buf, uint32_t size,
                                uint32_t timeout)
{
  return bk7258_saradc_read(buf, size, timeout) < 0 ? PHY_FAIL : PHY_OK;
}

static int phy_osi_cal_saradc_start(int32_t adc_channel, int32_t adc_clk,
                                    int32_t steady_time)
{
  int ret;

  ret = bk7258_saradc_start((uint8_t)adc_channel, PHY_ADC_MODE_CONTINUOUS,
                            bk7258_saradc_div((uint32_t)adc_clk),
                            PHY_ADC_SAT_MODE_3, (uint8_t)steady_time, 0, 0);

  return ret < 0 ? PHY_FAIL : PHY_OK;
}

static int phy_osi_cal_saradc_stop(int32_t adc_channel)
{
  UNUSED(adc_channel);
  return bk7258_saradc_stop() < 0 ? PHY_FAIL : PHY_OK;
}

static int phy_osi_saradc_start(uint8_t adc_channel, uint32_t sample_rate,
                                uint32_t div, uint32_t saradc_clk,
                                uint32_t saradc_mode, uint32_t saradc_xtal,
                                uint32_t saturate_mode,
                                uint32_t steady_time)
{
  int ret;

