Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_phy_osi.c
  UNUSED(saradc_clk);
  UNUSED(saradc_xtal);

  ret = bk7258_saradc_start(adc_channel, (uint8_t)saradc_mode, div,
                            (uint8_t)saturate_mode, (uint8_t)steady_time,
                            (uint8_t)sample_rate, 0);

  return ret < 0 ? PHY_FAIL : PHY_OK;
}

static int phy_osi_saradc_stop(uint8_t adc_channel)
{
  UNUSED(adc_channel);
  return bk7258_saradc_stop() < 0 ? PHY_FAIL : PHY_OK;
}

static void phy_osi_set_saradc_flag(UINT8 flag)
{
  bk7258_saradc_set_flag(flag);
}

/****************************************************************************
 * Name: phy_osi_flash_* / phy_osi_otp_*
 *
 * Description:
 *   Every one of these reports failure, and that is the port-wide decision
 *   about factory calibration made concrete.
 *
 *   The NuttX image is flashed at 0x11000; the RF calibration partition
 *   the vendor writes at production test sits at 0x7fe000, and this port
 *   carries no flash controller driver -- the execute-in-place window is
 *   CRC-encoded and cannot be read as a plain data region, so the bytes are
 *   not reachable even for reading.  OTP is likewise not driven here.
 *
 *   Failing rather than returning zeroed buffers is the whole point: a
 *   zero-filled "successful" read looks like a valid calibration record
 *   with every trim at zero, whereas a failure makes the library fall back
 *   to manual_cal_load_default_txpwr_tab() and the board tables in
 *   bk7258_vnd_cal.c.  Transmit power then comes out nominal instead of
 *   per-unit trimmed -- not accurate, but transmitting.
 *
 *   The partition locator returns 0 for the same reason: there is no
 *   partition table, and 0 is the address the library treats as "absent"
 *   rather than a plausible-looking offset it would then try to read.
 *
 ****************************************************************************/

static int phy_osi_flash_read_bytes(uint32_t address, uint8_t *user_buf,
                                    uint32_t size)
{
  UNUSED(address);
  UNUSED(user_buf);
  UNUSED(size);
  return PHY_FAIL;
}

static int phy_osi_flash_erase_sector(uint32_t address)
{
  UNUSED(address);
  return PHY_FAIL;
}

static int phy_osi_flash_write_bytes(uint32_t address,
                                     const uint8_t *user_buf, uint32_t size)
{
  UNUSED(address);
  UNUSED(user_buf);
  UNUSED(size);
  return PHY_FAIL;
}

static bk_err_t phy_osi_flash_protect_none(void)
{
  return PHY_FAIL;
}

static bk_err_t phy_osi_flash_unprotect_last_block(void)
{
  return PHY_FAIL;
}

static uint32_t phy_osi_flash_rf_firmware_info(void)
{
  return 0;
}

static int phy_osi_otp_read(uint32_t item, uint8_t *buf, uint32_t size)
{
  UNUSED(item);
  UNUSED(buf);
  UNUSED(size);
  return PHY_FAIL;
}

static int phy_osi_otp_update(uint32_t item, uint8_t *buf, uint32_t size)
{
  UNUSED(item);
  UNUSED(buf);
  UNUSED(size);
  return PHY_FAIL;
}

static int phy_osi_otp_rfcali_item(void)
{
  return PHY_FAIL;
}

static int phy_osi_save_rfcali_to_otp_enabled(void)
{
  return 0;
}

/****************************************************************************
 * Name: phy_osi_log / phy_osi_printf
 *
 * Description:
 *   The vendor points these at its own console writer, whose level values
 *   follow components/log.h (1 error .. 4 debug).  The tag is dropped
 *   rather than composed into a scratch buffer: calibration logging can be
 *   reached with interrupts masked, where a stack buffer large enough for a
 *   formatted line is not something to spend.
 *
 ****************************************************************************/

static void phy_osi_log(int level, char *tag, const char *fmt, ...)
{
  va_list ap;
  int priority;

  UNUSED(tag);

  switch (level)
    {
      case 1:
        priority = LOG_ERR;
        break;

      case 2:
        priority = LOG_WARNING;
        break;

      case 3:
        priority = LOG_INFO;
        break;

      default:
        priority = LOG_DEBUG;
        break;
    }

  va_start(ap, fmt);
  vsyslog(priority, fmt, ap);
  va_end(ap);
}

static void phy_osi_printf(const char *fmt, ...)
{
  va_list ap;

  va_start(ap, fmt);
  vsyslog(LOG_INFO, fmt, ap);
  va_end(ap);
}

static void phy_osi_null_printf(const char *fmt, ...)
{
  UNUSED(fmt);
}

static void phy_osi_shell_set_log_level(int level)
{
  UNUSED(level);
}

/****************************************************************************
 * Name: phy_osi_phy_log_enabled
 *
 * Description:
 *   Reports the library's own trace off, matching the vendor's shipped
 *   bk7258 configuration (CONFIG_PHY_LOG_ENABLE=n).  Returning 1 here is
 *   the switch that turns the closed library's internal tracing on through
 *   _log above; it costs nothing at link time, but the trace is emitted
 *   from inside calibration loops, so it is off by default.
 *
 ****************************************************************************/

static int phy_osi_phy_log_enabled(void)
{
  return 0;
}

/****************************************************************************
 * Name: phy_osi_ate_is_enabled
 *
 * Description:
 *   Reports production-test mode off, as bk7258_bt_osi.c does for the same
 *   question.  The vendor samples a boot pin latch this port does not read,
 *   and off is the state a shipped board is in.
 *
 ****************************************************************************/

static bool phy_osi_ate_is_enabled(void)
{
  return false;
}

/****************************************************************************
 * Name: phy_osi_malloc / free / mem and string helpers
 ****************************************************************************/

static void *phy_osi_malloc(uint32_t size)
{
  return kmm_malloc(size);
}

static void phy_osi_free(void *mem_ptr)
{
  kmm_free(mem_ptr);
}

static void *phy_osi_zalloc(size_t size)
{
  return kmm_zalloc(size);
}

static int32_t phy_osi_memcmp(const void *s, const void *s1, uint32_t n)
{
  return memcmp(s, s1, n);
}

static void *phy_osi_memset(void *b, int c, UINT32 len)
{
  return memset(b, c, len);
}

static void *phy_osi_memcpy(void *out, const void *in, uint32_t n)
{
  return memcpy(out, in, n);
}

static UINT32 phy_osi_strtoul(const char *nptr, char **endptr, int base)
{
  return (UINT32)strtoul(nptr, endptr, base);
}

static int phy_osi_strcasecmp(const char *s1, const char *s2)
{
  return strcasecmp(s1, s2);
}

static int32_t phy_osi_strcmp(const char *s1, const char *s2)
{
  return strcmp(s1, s2);
}

static int32_t phy_osi_strncmp(const char *s1, const char *s2,
                               const uint32_t n)
{
  return strncmp(s1, s2, n);
}

/****************************************************************************
 * Name: phy_osi_assert
 *
 * Description:
 *   The vendor panics here.  During bring-up a panic destroys the evidence
 *   that would say why the library gave up, so this logs and returns, the
 *   same choice bk7258_bt_osi.c made for the controller's reboot request.
 *
 ****************************************************************************/

