Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_phy_osi.c
static void phy_osi_assert(uint32_t exp)
{
  if (exp == 0)
    {
      syslog(LOG_ERR, "phy_osi: library assertion failed\n");
    }
}

/****************************************************************************
 * Name: phy_osi_get_time / phy_osi_delay_milliseconds
 *
 * Description:
 *   Milliseconds since boot.  The system tick is 10 ms here
 *   (CONFIG_USEC_PER_TICK=10000), so this has 10 ms granularity; every
 *   consumer in the library uses it for coarse timeouts and elapsed-time
 *   checks, not for RF timing, which comes off hardware counters.
 *
 *   The delay is a busy wait rather than a sleep for the same reason as in
 *   the controller port: it is called from analog settling paths that may
 *   already hold an interrupt lock, where a sleep would either assert or
 *   never wake.
 *
 ****************************************************************************/

static uint32_t phy_osi_get_time(void)
{
  return (uint32_t)TICK2MSEC(clock_systime_ticks());
}

static int phy_osi_delay_milliseconds(uint32_t num_ms)
{
  up_mdelay(num_ms);
  return PHY_OK;
}

/****************************************************************************
 * Name: phy_osi_timer_worker / phy_osi_*_timer
 *
 * Description:
 *   The library owns the beken_timer_t block and passes it by pointer, so
 *   only its three words may be touched; the NuttX work item lives in a
 *   separate allocation hung off the block's 'handle' word, which is what
 *   that word is for.
 *
 *   Callbacks run on the high-priority work queue rather than a watchdog:
 *   the vendor's are FreeRTOS software timers, so their handlers execute in
 *   a task and are free to allocate or take a lock, none of which is legal
 *   in a NuttX wdog callback.  As in the controller port, the timer re-arms
 *   before invoking the handler so the period is measured from callback
 *   entry, matching the vendor's own reload-then-call order.  A period
 *   shorter than one tick is clamped to one tick, since the tick here is
 *   10 ms and a zero-delay work item would spin the queue.
 *
 ****************************************************************************/

static void phy_osi_timer_worker(void *arg)
{
  struct phy_timer_ctx_s *ctx = arg;
  struct phy_beken_timer_s *t = ctx->owner;
  clock_t delay = MSEC2TICK(ctx->ms);

  if (ctx->running)
    {
      work_queue(HPWORK, &ctx->work, phy_osi_timer_worker, ctx,
                 delay > 0 ? delay : 1);
    }

  if (t != NULL && t->function != NULL)
    {
      t->function(t->arg);
    }
}

static int phy_osi_init_timer(void *timer, uint32_t time_ms,
                              void *function, void *arg)
{
  struct phy_beken_timer_s *t = timer;
  struct phy_timer_ctx_s *ctx;

  if (t == NULL)
    {
      return PHY_FAIL;
    }

  ctx = kmm_zalloc(sizeof(struct phy_timer_ctx_s));
  if (ctx == NULL)
    {
      return PHY_FAIL;
    }

  ctx->owner   = t;
  ctx->ms      = time_ms;

  t->function  = (void (*)(void *))function;
  t->arg       = arg;
  t->handle    = ctx;
  return PHY_OK;
}

static int phy_osi_start_timer(void *timer)
{
  struct phy_beken_timer_s *t = timer;
  struct phy_timer_ctx_s *ctx;
  clock_t delay;

  if (t == NULL || t->handle == NULL)
    {
      return PHY_FAIL;
    }

  ctx = t->handle;
  ctx->running = true;
  delay = MSEC2TICK(ctx->ms);

  return work_queue(HPWORK, &ctx->work, phy_osi_timer_worker, ctx,
                    delay > 0 ? delay : 1) < 0 ? PHY_FAIL : PHY_OK;
}

static bk_err_t phy_osi_reload_timer(void *timer)
{
  return phy_osi_start_timer(timer);
}

static int phy_osi_deinit_timer(void *timer)
{
  struct phy_beken_timer_s *t = timer;
  struct phy_timer_ctx_s *ctx;

  if (t == NULL || t->handle == NULL)
    {
      return PHY_FAIL;
    }

  ctx = t->handle;
  ctx->running = false;

  /* Synchronous cancel, so the worker cannot still be mid-callback on a
   * block that is about to be freed -- but not from interrupt context,
   * where the sync path would block on the very work thread it interrupted.
   */

  if (up_interrupt_context())
    {
      work_cancel(HPWORK, &ctx->work);
    }
  else
    {
      work_cancel_sync(HPWORK, &ctx->work);
    }

  t->handle = NULL;
  kmm_free(ctx);
  return PHY_OK;
}

/****************************************************************************
 * Name: phy_osi_gpio_dev_map_rxen
 *
 * Description:
 *   Fails, for the same reason bt_osi_gpio_dev_map() does: the caller names
 *   a pad by GPIO number and asks for the external RX-switch function on
 *   it, and turning that into this part's per-pin alternate-function index
 *   needs the SDK's gpio_map table, which this port does not carry.  This
 *   board has no external RX switch either, so there is nothing to route;
 *   picking an alternate function at random would put a live peripheral on
 *   an arbitrary pad.
 *
 ****************************************************************************/

static int phy_osi_gpio_dev_map_rxen(uint32_t gpio_id)
{
  UNUSED(gpio_id);
  return PHY_FAIL;
}

/****************************************************************************
 * Name: phy_osi_ble_in_dut_mode / _get_tx_pwr_idx / _txpwr_max_set_bt_polar
 *        / _ble_tx_testmode_retrig
 *
 * Description:
 *   Forwarded to the closed bluetooth controller, which is where the state
 *   they report actually lives: the DUT-mode flag, the negotiated transmit
 *   power index, the polar-mode power ceiling and the test-mode retrigger.
 *   Stubbing _get_tx_pwr_idx in particular would pin transmit power to
 *   index 0 regardless of what the link layer asked for.
 *
 ****************************************************************************/

static bk_err_t phy_osi_ble_in_dut_mode(void)
{
  return ble_in_dut_mode();
}

static uint8_t phy_osi_get_tx_pwr_idx(void)
{
  return get_tx_pwr_idx();
}

static void phy_osi_txpwr_max_set_bt_polar(void)
{
  txpwr_max_set_bt_polar();
}

static void phy_osi_ble_tx_testmode_retrig(void)
{
  bluetooth_rf_test_mode_retrig();
}

/****************************************************************************
 * Name: phy_osi_rf_module_power_ctrl / phy_osi_rf_pm_vote_power
 *
 * Description:
 *   The two power entries the RF arbiter uses.  rf_module_vote_ctrl calls
 *   the vote form with the RF sub-domain name on every open and close of
 *   the radio, so this is on the live path, not the sleep path, and it does
 *   real work.  The direct form is the vendor's un-counted variant; both
 *   land on the same domain gate here because this image has a single
 *   radio user and therefore a vote count that is always 0 or 1.
 *
 ****************************************************************************/

static void phy_osi_rf_module_power_ctrl(unsigned int module,
                                         uint32_t power_state)
{
  phy_power_domain_ctrl(module, power_state);
}

