Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_phy_osi.c
static bk_err_t phy_osi_rf_pm_vote_power(unsigned int module,
                                         uint32_t power_state)
{
  return phy_power_domain_ctrl(module, power_state);
}

/****************************************************************************
 * Name: phy_osi_dsss_only_stub
 *
 * Description:
 *   Stub pair.  Both switch the Wi-Fi modem between DSSS-only and full
 *   OFDM reception while bluetooth holds the radio; with no Wi-Fi modem in
 *   this image there is nothing to narrow.  The vendor compiles its bodies
 *   out under the same condition.
 *
 ****************************************************************************/

static void phy_osi_dsss_only_stub(void)
{
}

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Not const: the library keeps only the pointers it is handed, and the
 * vendor's own copies live in writable data.  Entries left NULL are the
 * ones the vendor also leaves NULL for this part -- the BK7256 RISC-V
 * block, the BK7239 analog block, and the Wi-Fi test hooks -- and an empty
 * stub there would be worse than NULL, because several of them are feature
 * probes whose honest answer is "absent", not "present and does nothing".
 */

phy_os_funcs_t g_phy_os_funcs =
{
  ._version                          = PHY_OSI_VERSION,

  ._mpb_reg_api                      = phy_osi_null_reg_api,
  ._crm_reg_api                      = phy_osi_null_reg_api,
  ._riu_reg_api                      = phy_osi_null_reg_api,
  ._mix_funcs                        = phy_osi_null_reg_api,
  ._bk_misc_get_reset_reason         = phy_osi_get_reset_reason,

  /* Wi-Fi rate-sensitivity and EVM test entries: absent, as the vendor
   * leaves them with CONFIG_WIFI_ENABLE off.  Verified absent-and-safe
   * rather than assumed: with --gc-sections applied, the only code left in
   * the image that reaches any of them is nv_init, and it reaches
   * _nv_phy_reg_set_hook, which is therefore the one entry here that is
   * filled in.
   */

  ._rs_init                          = NULL,
  ._rs_bypass_mac_init               = NULL,
  ._rs_deinit                        = NULL,
  ._evm_init                         = NULL,
  ._evm_bypass_mac_init              = NULL,
  ._nv_phy_reg_set_hook              = phy_osi_nv_reg_set_hook,
  ._evm_clear_ke_evt_mac_bit         = NULL,
  ._evm_set_ke_evt_mac_bit           = NULL,
  ._tx_evm_set_chan_ctxt_pop         = NULL,
  ._save_info_item                   = NULL,
  ._get_info_item                    = NULL,

  ._delay                            = phy_osi_delay,
  ._delay_us                         = phy_osi_delay_us,
  ._ddev_control                     = phy_osi_ddev_control,
  ._bk_wdt_stop                      = phy_osi_wdt_stop,

  ._temp_detect_is_init              = phy_osi_temp_detect_is_init,
  ._temp_detect_deinit               = phy_osi_temp_detect_deinit,
  ._temp_detect_init                 = phy_osi_temp_detect_init,
  ._temp_detect_get_temperature      = phy_osi_temp_detect_get,
  ._bk_feature_temp_detect_enable    = phy_osi_temp_detect_enabled,

  ._ate_is_enabled                   = phy_osi_ate_is_enabled,
  ._volt_single_get_current_voltage  = phy_osi_get_voltage,
  ._saradc_calculate                 = phy_osi_saradc_calculate,

  ._bk_pm_clock_ctrl_saradc_pwrup    = phy_osi_pm_saradc_pwrup,
  ._bk_pm_clock_ctrl_phy_pwrup       = phy_osi_pm_phy_pwrup,
  ._bk_pm_module_vote_power_ctrl_phy = phy_osi_pm_vote_power_phy,
  ._bk_pm_module_vote_cpu_freq       = phy_osi_pm_vote_cpu_freq,

  ._aon_pmu_hal_get_chipid           = phy_osi_get_chipid,
  ._aon_pmu_drv_bias_cal_get         = phy_osi_bias_cal_get,
  ._aon_pmu_drv_get_adc_cal          = phy_osi_adc_cal_get,

  ._sys_ll_set_ana_reg5_adc_div      = phy_osi_set_adc_div,
  ._sys_ll_get_ana_reg5_adc_div      = phy_osi_get_adc_div,
  ._sys_ll_set_ana_reg8_ioldo_lp     = phy_osi_set_ioldo_lp,
  ._sys_ll_set_ana_reg9_vcorehsel    = phy_osi_set_vcorehsel,
  ._sys_ll_set_ana_reg9_spi_latch1v  = phy_osi_set_spi_latch1v,
  ._sys_ll_set_ana_reg10_iobyapssen  = phy_osi_set_iobyapssen,
  ._sys_ll_set_ana_reg11_aldosel     = phy_osi_set_aldosel,
  ._sys_ll_set_ana_reg12_dldosel     = phy_osi_set_dldosel,

  ._sys_drv_cali_dpll                = phy_osi_cali_dpll,
  ._sys_drv_set_ana_ioldo_lp         = phy_osi_drv_set_ioldo_lp,
  ._sys_drv_set_ana_cb_cal_manu_val  = phy_osi_set_cb_cal_manu_val,
  ._sys_drv_set_ana_cb_cal_trig      = phy_osi_set_cb_cal_trig,
  ._sys_drv_set_ana_cb_cal_manu      = phy_osi_set_cb_cal_manu,
  ._sys_drv_analog_set_xtalh_ctune   = phy_osi_set_xtalh_ctune,

  ._phy_sys_drv_modem_bus_clk_ctrl_on = phy_osi_modem_bus_clk_on,
  ._phy_sys_drv_modem_clk_ctrl_on     = phy_osi_modem_clk_on,

  ._bk_adc_read_raw                  = phy_osi_adc_read_raw,
  ._bk_cal_saradc_start              = phy_osi_cal_saradc_start,
  ._bk_cal_saradc_stop               = phy_osi_cal_saradc_stop,
  ._bk_saradc_start                  = phy_osi_saradc_start,
  ._bk_saradc_stop                   = phy_osi_saradc_stop,

  ._bk_flash_read_bytes              = phy_osi_flash_read_bytes,
  ._bk_flash_erase_sector            = phy_osi_flash_erase_sector,
  ._bk_flash_write_bytes             = phy_osi_flash_write_bytes,

  ._bk_flash_set_protect_type_protect_none = phy_osi_flash_protect_none,
  ._bk_flash_set_protect_type_unprotect_last_block =
                                       phy_osi_flash_unprotect_last_block,
  ._bk_flash_partition_get_rf_firmware_info =
                                       phy_osi_flash_rf_firmware_info,

  ._bk_otp_apb_read                  = phy_osi_otp_read,
  ._bk_otp_apb_update                = phy_osi_otp_update,

  ._log                              = phy_osi_log,
  ._log_raw                          = phy_osi_log,
  ._get_time                         = phy_osi_get_time,

  ._bk_printf                        = phy_osi_printf,
  ._bk_null_printf                   = phy_osi_null_printf,
  ._shell_set_log_level              = phy_osi_shell_set_log_level,

  ._os_malloc                        = phy_osi_malloc,
  ._os_free                          = phy_osi_free,
  ._os_memcmp                        = phy_osi_memcmp,
  ._os_memset                        = phy_osi_memset,
  ._os_zalloc                        = phy_osi_zalloc,
  ._os_strtoul                       = phy_osi_strtoul,
  ._os_strcasecmp                    = phy_osi_strcasecmp,
  ._os_strcmp                        = phy_osi_strcmp,
  ._os_strncmp                       = phy_osi_strncmp,
  ._os_memcpy                        = phy_osi_memcpy,

  ._rtos_assert                      = phy_osi_assert,
  ._rtos_enable_int                  = rtos_enable_int,
  ._rtos_disable_int                 = rtos_disable_int,
  ._rtos_get_time                    = phy_osi_get_time,
  ._rtos_start_timer                 = phy_osi_start_timer,
  ._rtos_init_timer                  = phy_osi_init_timer,
  ._rtos_deinit_timer                = phy_osi_deinit_timer,
  ._rtos_reload_timer                = phy_osi_reload_timer,
  ._rtos_delay_milliseconds          = phy_osi_delay_milliseconds,

