Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_phy_osi.c
  /* BK7256 (RISC-V) block: absent on this part. */

  ._riscv_get_mtimer                 = NULL,
  ._sys_drv_set_ana_vctrl_sysldo     = NULL,
  ._sys_drv_analog_reg3_set          = NULL,
  ._sys_drv_analog_reg2_set          = NULL,
  ._sys_drv_flash_cksel              = NULL,
  ._sys_drv_set_ana_scal_en          = NULL,
  ._sys_drv_set_ana_gadc_buf_ictrl   = NULL,
  ._sys_drv_set_ana_gadc_cmp_ictrl   = NULL,
  ._sys_drv_set_ana_vtempsel         = NULL,
  ._sys_drv_set_ana_vref_sel         = NULL,
  ._sys_drv_set_ana_vhsel_ldodig     = NULL,
  ._sys_drv_set_ana_pwd_gadc_buf     = NULL,

  ._sys_drv_set_bgcalm               = phy_osi_set_bgcalm,
  ._sys_drv_get_bgcalm               = phy_osi_get_bgcalm,
  ._sys_drv_set_vdd_value            = phy_osi_set_vdd_value,
  ._sys_drv_get_vdd_value            = phy_osi_get_vdd_value,

  ._aon_pmu_hal_get_reg0x7c          = NULL,
  ._aon_pmu_get_device_id            = NULL,

  ._gpio_dev_unmap                   = NULL,
  ._gpio_dev_map_txen                = NULL,
  ._bk_gpio_pull_down                = NULL,
  ._bk_get_hardware_chip_id_version  = NULL,
  ._bk_efuse_read_byte               = NULL,

  /* BK7239/BK7286 analog block: absent on this part. */

  ._sys_ll_set_ana_reg0_cksel        = NULL,
  ._sys_ll_set_ana_reg0_dsptrig      = NULL,
  ._sys_ll_set_ana_reg8_t_vanaldosel = NULL,
  ._sys_ll_set_ana_reg8_r_vanaldosel = NULL,
  ._sys_ll_set_ana_reg9_vcorelsel    = NULL,

  ._bk_set_g_saradc_flag             = phy_osi_set_saradc_flag,

  ._ble_in_dut_mode                  = phy_osi_ble_in_dut_mode,
  ._get_tx_pwr_idx                   = phy_osi_get_tx_pwr_idx,
  ._txpwr_max_set_bt_polar           = phy_osi_txpwr_max_set_bt_polar,
  ._ble_tx_testmode_retrig           = phy_osi_ble_tx_testmode_retrig,

  ._gpio_dev_map_rxen                = phy_osi_gpio_dev_map_rxen,

  ._bk_phy_get_wifi_media_mode_config = phy_osi_wifi_media_mode,
  ._bk_feature_save_rfcali_to_otp_enable =
                                       phy_osi_save_rfcali_to_otp_enabled,
  ._bk_otp_ahb_read                  = phy_osi_otp_read,
  ._bk_otp_ahb_update                = phy_osi_otp_update,
  ._bk_get_otp_ahb_rfcali_item       = phy_osi_otp_rfcali_item,
  ._sys_ll_set_ana_reg8_violdosel    = phy_osi_set_violdosel,
  ._sys_ll_set_ana_reg8_iocurlim     = phy_osi_set_iocurlim,
  ._bk_feature_phy_log_enable        = phy_osi_phy_log_enabled,
};

/* Constants the library reads out of the table instead of compiling in, so
 * one binary can serve several parts.  The legacy driver-model handles and
 * command codes are left at zero: _ddev_control above is a stub, so nothing
 * consumes them, and the SDK enums they come from are assembled out of a
 * dozen configuration switches -- a transcribed guess would be a value that
 * looks authoritative and is not.
 */

phy_os_variable_t g_phy_os_variable =
{
  ._saradc_autotest            = 0,

  ._rf_cfg_tssi_item           = PHY_RF_CFG_TSSI_ITEM,
  ._rf_cfg_mode_item           = PHY_RF_CFG_MODE_ITEM,
  ._rf_cfg_tssi_b_item         = PHY_RF_CFG_TSSI_B_ITEM,

  ._cmd_tl410_clk_pwr_up       = 0,
  ._pwd_ble_clk_bit            = (1u << 1),

  ._pm_cpu_frq_60m             = PHY_PM_CPU_FRQ_60M,
  ._pm_cpu_frq_80m             = PHY_PM_CPU_FRQ_80M,
  ._pm_cpu_frq_120m            = PHY_PM_CPU_FRQ_120M,
  ._pm_cpu_frq_320m            = PHY_PM_CPU_FRQ_320M,
  ._pm_cpu_frq_default         = PHY_PM_CPU_FRQ_DEFAULT,

  ._pm_dev_id_phy              = PHY_PM_DEV_ID_PHY,

  ._dd_dev_type_ble            = 0,
  ._dd_dev_type_sctrl          = 0,
  ._dd_dev_type_icu            = 0,
  ._dd_dev_type_flash          = 0,

  ._chip_version_a             = PHY_CHIP_VERSION_A,
  ._chip_version_b             = PHY_CHIP_VERSION_B,
  ._chip_version_c             = PHY_CHIP_VERSION_C,
  ._chip_version_default       = PHY_CHIP_VERSION_DEFAULT,

  ._pm_chip_id_mask            = PHY_CHIP_ID_MASK,
  ._pm_chip_id_mpw_v2_3        = PHY_CHIP_ID_MPW_V2_3,
  ._pm_chip_id_mpw_v4          = PHY_CHIP_ID_MPW_V4,
  ._pm_chip_id_mp_a            = PHY_CHIP_ID_MP_A,

  ._cmd_get_device_id          = 0,
  ._cmd_sctrl_ble_powerdown    = 0,
  ._cmd_sctrl_ble_powerup      = 0,
  ._cmd_ble_rf_bit_set         = 0,
  ._cmd_ble_rf_bit_clr         = 0,
  ._cmd_sctrl_get_vdd_value    = 0,
  ._cmd_sctrl_set_vdd_value    = 0,

  ._param_xtalh_ctune_mask     = PHY_PARAM_XTALH_CTUNE_MASK,
  ._param_aud_dac_gain_mask    = PHY_PARAM_AUD_DAC_GAIN_MASK,

  ._pm_power_module_state_on   = PHY_PWR_STATE_ON,
  ._pm_power_module_state_off  = PHY_PWR_STATE_OFF,
  ._pm_power_module_state_none = PHY_PWR_STATE_NONE,

  ._adc_temp_10degree_per_dbpwr = PHY_ADC_TEMP_10DEG_PER_DBPWR,
  ._adc_temp_buffer_size        = PHY_ADC_TEMP_BUFFER_SIZE,
  ._adc_temp_lsb_per_10degree   = PHY_ADC_TEMP_LSB_PER_10DEG,
  ._adc_temp_val_min            = PHY_ADC_TEMP_VAL_MIN,
  ._adc_temp_val_max            = PHY_ADC_TEMP_VAL_MAX,
  ._adc_xtal_dist_intial_val    = PHY_ADC_XTAL_DIST_INITIAL,
  ._adc_temp_dist_intial_val    = PHY_ADC_TEMP_DIST_INITIAL,

  ._ieee80211_band_2ghz        = 0,
  ._ieee80211_band_5ghz        = 1,
  ._ieee80211_band_6ghz        = 2,
  ._ieee80211_band_60ghz       = 3,
  ._ieee80211_num_bands        = 4,

  ._otp_mac_address            = PHY_OTP_MAC_ADDRESS,
  ._otp_vdddig_bandgap         = PHY_OTP_VDDDIG_BANDGAP,
  ._otp_dia                    = PHY_OTP_DIA,
  ._otp_gadc_temperature       = PHY_OTP_GADC_TEMPERATURE,
  ._otp_sdmadc_calibration     = PHY_OTP_SDMADC_CALIBRATION,
};

/* The RF arbiter's table.  _rwnx_cal_mac_sleep_rc_recover forwards to the
 * closed PHY archive rather than being stubbed: it restores the radio
 * controller's register file after a sleep-induced reset of it, the arbiter
 * calls it directly on one path and through this table on another, and the
 * two must do the same thing.
 */

rf_control_funcs_t g_rf_control_funcs =
{
  ._sys_drv_modem_bus_clk_ctrl    = phy_modem_bus_clk_ctrl,
  ._sys_drv_modem_clk_ctrl        = phy_modem_clk_ctrl,
  ._phy_exit_dsss_only            = phy_osi_dsss_only_stub,
  ._phy_enter_dsss_only           = phy_osi_dsss_only_stub,
  ._rtos_disable_int              = rtos_disable_int,
  ._rtos_enable_int               = rtos_enable_int,
  ._rwnx_cal_mac_sleep_rc_recover = rwnx_cal_mac_sleep_rc_recover,
  ._sys_drv_module_power_ctrl     = phy_osi_rf_module_power_ctrl,
  ._sys_drv_set_ana_reg11_apfms   = phy_osi_set_apfms,
  ._sys_drv_set_ana_reg12_dpfms   = phy_osi_set_dpfms,
  ._bk_pm_module_vote_power_ctrl  = phy_osi_rf_pm_vote_power,
};

/* Domain identifiers, not flags: 10 is the PHY power domain and 202 is its
 * RF sub-domain (10 * 20 + 2, the sub-domain stride from the SDK's bk7258
 * sys_types.h).  The arbiter loads the sub-domain name and one of the two
 * states straight out of this block.
 */

rf_variable_t g_rf_variable =
{
  ._pm_power_module_state_off = PHY_PWR_STATE_OFF,
  ._pm_power_module_state_on  = PHY_PWR_STATE_ON,
  ._pm_power_module_name_phy  = PHY_PWR_MODULE_WIFI_PHY,
  ._pm_power_module_name_rf   = PHY_PWR_MODULE_WIFI_PHY *
                                PHY_PWR_SUB_DOMAIN_STRIDE + 2,
};

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_phy_adapter_init
 *
 * Description:
 *   Hand the OS abstraction tables to the closed PHY archive.  Must run
 *   before anything touches the radio: until it does, every pointer the
 *   library reaches through g_phy_funcs_t is NULL.  The library keeps the
 *   two addresses, so the tables must stay alive for the life of the
 *   image -- they are file-scope objects, which they are.
 *
 * Returned Value:
 *   Always OK; the closed entry point returns void and validates nothing,
 *   so there is no acceptance to report.
 *
 ****************************************************************************/

int bk7258_phy_adapter_init(void)
{
  phy_adapter_init(&g_phy_os_funcs, &g_phy_os_variable);
  return PHY_OK;
}

/****************************************************************************
 * Name: bk7258_rf_adapter_init
 *
 * Description:
 *   Hand the RF arbiter its tables.  This is the one that closes the bus
 *   fault at rf_module_vote_ctrl: that function's first act is to call
 *   through g_rf_funcs_t for the interrupt lock.
 *
 *   rf_cntrl_init() follows, as it does in the vendor's own
 *   bk_rf_adapter_init().  It is not decoration: it clears the arbiter's
 *   private state and sets its "radio is currently closed" flag, and that
 *   flag is what the first RF_OPEN vote tests to decide whether to power
 *   the PHY domain up.  Left at its zero-initialised value the vote would
 *   run to completion, touch nothing, and leave the radio dark -- a quieter
 *   failure than the crash, and a harder one to see.
 *
 * Returned Value:
 *   Always OK; both closed entry points return void.
 *
 ****************************************************************************/

int bk7258_rf_adapter_init(void)
{
  rf_adapter_init(&g_rf_control_funcs, &g_rf_variable);
  rf_cntrl_init();
  return PHY_OK;
}
